package test6ver2;														
														
/**
 *　【問題】
 *以下について説明してください。
 *①クラスにpublicをつけるとどうなるか
 *②クラスにprivateをつけるとどうなるか
 *③クラスにpublicもprivateもつけないとどうなるか
 *④メソッドにpublicをつけるとどうなるか
 *⑤メソッドにprivateをつけるとどうなるか
 *⑥メソッドにpublicもprivateもつけないとどうなるか
 *⑦フィールドにpublicをつけるとどうなるか
 *⑧フィールドにprivateをつけるとどうなるか
 *⑨フィールドにpublicもprivateもつけないとどうなるか				
 */
/**
 * 【回答】 
 * ①クラスの外からクラスにアクセス出来る
 * ②つけれない
 * ③パッケージのクラス内からクラスにアクセス出来る
 * ④クラスの外からメソッドにアクセス出来る
 * ⑤クラスの外からメソッドにアクセス出来ない
 * ⑥パッケージのクラス内からメソッドにアクセス出来る
 * ⑦クラスの外からフィールドにアクセス出来る
 * ⑧クラスの外からフィールドにアクセス出来ない
 * ⑨パッケージのクラス内からフィールドにアクセス出来る
 */